experiments/torch-geometry/cfd/e0b_wall/system/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

scale 1;
// fluid bore r=0..8.5mm ; sapphire wall r=8.5..10.5mm ; L=100mm ; 5 deg wedge
vertices
(
    (0    0       0)              //0 axis inlet
    (0.10 0       0)              //1 axis outlet
    (0.10 0.0085 -0.000371119)    //2
    (0    0.0085 -0.000371119)    //3
    (0.10 0.0085  0.000371119)    //4
    (0    0.0085  0.000371119)    //5
    (0.10 0.0105 -0.000458440)    //6
    (0    0.0105 -0.000458440)    //7
    (0.10 0.0105  0.000458440)    //8
    (0    0.0105  0.000458440)    //9
);
blocks
(
    hex (0 1 2 3 0 1 4 5) fluid (200 40 1) simpleGrading (1 1 1)
    hex (3 2 6 7 5 4 8 9) solid (200 10 1) simpleGrading (1 1 1)
);
edges ();
boundary
(
    inlet     { type patch; faces ( (0 3 5 0) ); }
    outlet    { type patch; faces ( (1 1 4 2) ); }
    outerWall { type wall;  faces ( (7 6 8 9) ); }
    solidEnds { type patch; faces ( (3 7 9 5) (2 6 8 4) ); }
    front     { type wedge; faces ( (0 1 4 5) (5 4 8 9) ); }
    back      { type wedge; faces ( (0 3 2 1) (3 2 6 7) ); }
);
