experiments/torch-geometry/cfd/e0b_wall/constant/fluid/turbulenceProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object turbulenceProperties;
}

simulationType laminar;
