experiments/torch-geometry/cfd/e0b_wall/constant/fluid/fvOptions
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fvOptions;
}

// same source as 0a, so the two phases are directly comparable
heatSource
{
    type scalarSemiImplicitSource; selectionMode all; volumeMode specific;
    sources { h { explicit 5.84e5; implicit 0; } }
}
