experiments/torch-geometry/cfd/e0b_wall/constant/fluid/radiationProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object radiationProperties;
}

radiation off;
radiationModel none;
