experiments/torch-geometry/cfd/e0b_wall/constant/fluid/thermophysicalProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object thermophysicalProperties;
}

thermoType { type heRhoThermo; mixture pureMixture; transport const;
             thermo hConst; equationOfState perfectGas; specie specie; energy sensibleEnthalpy; }
mixture { specie { molWeight 28.014; } thermodynamics { Cp 1040; Hf 0; }
          transport { mu 1.76e-05; Pr 0.72; } }
