experiments/torch-geometry/cfd/e0b_wall/constant/regionProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object regionProperties;
}

// which split regions are fluid and which are solid
regions
(
    fluid       (fluid)
    solid       (solid)
);
