experiments/torch-geometry/cfd/e0b_wall/0/fluid/p
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object p;
}

dimensions [1 -1 -2 0 0 0 0];
internalField uniform 100000;
boundaryField
{
    inlet  { type zeroGradient; }
    outlet { type fixedValue; value uniform 100000; }
    "(front|back)" { type wedge; }
    fluid_to_solid { type zeroGradient; }
}
