experiments/torch-geometry/cfd/e0b_wall/0/solid/p
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object p;
}

// A solid region still carries p for rhoThermo. `calculated` per the working
// multiRegionHeater tutorial; wedge patches keep the wedge type.
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 100000;
boundaryField
{
    outerWall      { type calculated; value uniform 100000; }
    solidEnds      { type calculated; value uniform 100000; }
    "(front|back)" { type wedge; }
    solid_to_fluid { type calculated; value uniform 100000; }
}
