experiments/torch-geometry/cfd/e0b_wall/0/fluid/T
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object T;
}

dimensions [0 0 0 1 0 0 0];
internalField uniform 300;
boundaryField
{
    inlet  { type fixedValue; value uniform 300; }
    outlet { type zeroGradient; }
    "(front|back)" { type wedge; }
    fluid_to_solid
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        Tnbr            T;
        kappaMethod     fluidThermo;
        value           uniform 300;
    }
}
