experiments/torch-geometry/cfd/e0b_wall/system/fluid/fvSolution
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fvSolution;
}

solvers
{
    p_rgh { solver GAMG; tolerance 1e-08; relTol 0.01; smoother GaussSeidel; maxIter 100; }
    p     { solver GAMG; tolerance 1e-08; relTol 0.01; smoother GaussSeidel; maxIter 100; }
    "(U|h|e|k|epsilon)" { solver PBiCGStab; preconditioner DILU; tolerance 1e-09; relTol 0.01; }
}
// U excluded from residualControl: wedge Uz never settles (see BRIDGE.md phase 0a)
SIMPLE { nNonOrthogonalCorrectors 0; rhoMin 0.1; rhoMax 10;
         residualControl { p_rgh 1e-7; h 1e-7; } }
relaxationFactors { fields { p_rgh 0.3; rho 1; } equations { U 0.7; h 0.7; } }
