experiments/torch-geometry/cfd/e0b_wall/system/fvSolution
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fvSolution;
}

solvers {}
