experiments/torch-geometry/cfd/e0b_wall/system/solid/fvSolution
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fvSolution;
}

solvers { h { solver PCG; preconditioner DIC; tolerance 1e-10; relTol 0.01; } }
SIMPLE { nNonOrthogonalCorrectors 0; residualControl { h 1e-8; } }
relaxationFactors { equations { h 1; } }
